nxp-mcuxpresso/mcux-soc-svd/LPC55S04/LPC55S04.xml
        <register>
          <name>TSTAT</name>
          <description>Trigger Status Register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>TEXC_NUM</name>
              <description>Trigger Exception Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TEXC_NUM_0</name>
                  <description>No triggers have been interrupted by a high priority exception. Or CFG[TRES] = 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEXC_NUM_1</name>
                  <description>Trigger 0 has been interrupted by a high priority exception.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEXC_NUM_2</name>
                  <description>Trigger 1 has been interrupted by a high priority exception.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEXC_NUM_3</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEXC_NUM_4</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEXC_NUM_5</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEXC_NUM_6</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEXC_NUM_7</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEXC_NUM_8</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEXC_NUM_9</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEXC_NUM_10</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEXC_NUM_11</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEXC_NUM_12</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEXC_NUM_65529</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0xFFF9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEXC_NUM_65530</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0xFFFA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEXC_NUM_65531</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0xFFFB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEXC_NUM_65532</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0xFFFC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEXC_NUM_65533</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0xFFFD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEXC_NUM_65534</name>
                  <description>Associated trigger sequence has interrupted by a high priority exception.</description>
                  <value>0xFFFE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEXC_NUM_65535</name>
                  <description>Every trigger sequence has been interrupted by a high priority exception.</description>
                  <value>0xFFFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCOMP_FLAG</name>
              <description>Trigger Completion Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCOMP_FLAG_0</name>
                  <description>No triggers have been completed. Trigger completion interrupts are disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCOMP_FLAG_1</name>
                  <description>Trigger 0 has been completed and triger 0 has enabled completion interrupts.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCOMP_FLAG_2</name>
                  <description>Trigger 1 has been completed and triger 1 has enabled completion interrupts.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCOMP_FLAG_3</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCOMP_FLAG_4</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCOMP_FLAG_5</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCOMP_FLAG_6</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCOMP_FLAG_7</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCOMP_FLAG_8</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCOMP_FLAG_9</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCOMP_FLAG_10</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCOMP_FLAG_11</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCOMP_FLAG_12</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCOMP_FLAG_65529</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0xFFF9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCOMP_FLAG_65530</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0xFFFA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCOMP_FLAG_65531</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0xFFFB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCOMP_FLAG_65532</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0xFFFC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCOMP_FLAG_65533</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0xFFFD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCOMP_FLAG_65534</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0xFFFE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCOMP_FLAG_65535</name>
                  <description>Every trigger sequence has been completed and every trigger has enabled completion interrupts.</description>
                  <value>0xFFFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OFSTRIM</name>
          <description>ADC Offset Trim Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OFSTRIM_A</name>
              <description>Trim for offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFSTRIM_B</name>
              <description>Trim for offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
