nxp-mcuxpresso/mcux-soc-svd/LPC55S04/LPC55S04.xml
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TCTRL[%s]</name>
          <description>Trigger Control Register</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HTEN</name>
              <description>Trigger enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HTEN_0</name>
                  <description>Hardware trigger source disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HTEN_1</name>
                  <description>Hardware trigger source enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFO_SEL_A</name>
              <description>SAR Result Destination For Channel A</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFO_SEL_A_0</name>
                  <description>Result written to FIFO 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO_SEL_A_1</name>
                  <description>Result written to FIFO 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFO_SEL_B</name>
              <description>SAR Result Destination For Channel B</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFO_SEL_B_0</name>
                  <description>Result written to FIFO 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO_SEL_B_1</name>
                  <description>Result written to FIFO 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPRI</name>
              <description>Trigger priority setting</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TPRI_0</name>
                  <description>Set to highest priority, Level 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_1</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_2</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_3</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_4</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_5</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_6</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_7</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_8</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_9</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_10</name>
                  <description>Set to corresponding priority level</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_11</name>
                  <description>Set to corresponding priority level</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_12</name>
                  <description>Set to corresponding priority level</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_13</name>
                  <description>Set to corresponding priority level</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_14</name>
                  <description>Set to corresponding priority level</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_15</name>
                  <description>Set to lowest priority, Level 16</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSYNC</name>
              <description>Trigger Resync</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TDLY</name>
              <description>Trigger delay select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCMD</name>
              <description>Trigger command select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCMD_0</name>
                  <description>Not a valid selection from the command buffer. Trigger event is ignored.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_1</name>
                  <description>CMD1 is executed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_2</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_3</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_4</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_5</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_6</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_7</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_8</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_9</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_10</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_11</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_12</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_13</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_14</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_15</name>
                  <description>CMD15 is executed</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FCTRL[%s]</name>
          <description>FIFO Control Register</description>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FCOUNT</name>
              <description>Result FIFO counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FWMARK</name>
              <description>Watermark level selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>GCC[%s]</name>
          <description>Gain Calibration Control</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GAIN_CAL</name>
              <description>Gain Calibration Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDY</name>
              <description>Gain Calibration Value Valid</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RDY_0</name>
                  <description>The gain calibration value is invalid. Run the auto-calibration routine for this value to be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY_1</name>
                  <description>The gain calibration value is valid. It should be used to update the GCRa[GCALR] register field.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>GCR[%s]</name>
          <description>Gain Calculation Result</description>
          <addressOffset>0xF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GCALR</name>
              <description>Gain Calculation Result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDY</name>
              <description>Gain Calculation Ready</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RDY_0</name>
                  <description>The gain offset calculation value is invalid.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY_1</name>
                  <description>The gain calibration value is valid.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMDL1</name>
          <description>ADC Command Low Buffer Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCH</name>
              <description>Input channel select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCH_0</name>
                  <description>Select CH0A or CH0B or CH0A/CH0B pair.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_1</name>
                  <description>Select CH1A or CH1B or CH1A/CH1B pair.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_2</name>
                  <description>Select CH2A or CH2B or CH2A/CH2B pair.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_3</name>
                  <description>Select CH3A or CH3B or CH3A/CH3B pair.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_4</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_5</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_6</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_7</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_8</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_9</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_10</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_11</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_12</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_13</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_24</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_25</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_26</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_27</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_28</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_29</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_30</name>
                  <description>Select CH30A or CH30B or CH30A/CH30B pair.</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_31</name>
                  <description>Select CH31A or CH31B or CH31A/CH31B pair.</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTYPE</name>
              <description>Conversion Type</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CTYPE_0</name>
                  <description>Single-Ended Mode. Only A side channel is converted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTYPE_1</name>
                  <description>Single-Ended Mode. Only B side channel is converted.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTYPE_2</name>
                  <description>Differential Mode. A-B.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTYPE_3</name>
                  <description>Dual-Single-Ended Mode. Both A side and B side channels are converted independently.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Select resolution of conversions</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE_0</name>
                  <description>Standard resolution. Single-ended 12-bit conversion; Differential 13-bit conversion with 2's complement output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE_1</name>
                  <description>High resolution. Single-ended 16-bit conversion; Differential 16-bit conversion with 2's complement output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
